{"class_name": "Model", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [20, 432], "name": "glimpse_input", "sparse": false}, "inbound_nodes": [], "name": "glimpse_input"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [20, 2], "name": "location_input", "sparse": false}, "inbound_nodes": [], "name": "location_input"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "name": "glimpse_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["glimpse_input", 0, 0, {}]]], "name": "glimpse_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "name": "location_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["location_input", 0, 0, {}]]], "name": "location_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "name": "glimpse_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["glimpse_2", 0, 0, {}]]], "name": "glimpse_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "name": "location_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["location_1", 0, 0, {}]]], "name": "location_2"}, {"class_name": "Add", "config": {"trainable": true, "name": "add"}, "inbound_nodes": [[["glimpse_3", 0, 0, {}], ["location_2", 0, 0, {}]]], "name": "add"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\r\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000S(\u0001\u0000\u0000\u0000N(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0004\u0000\u0000\u0000relu(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s!\u0000\u0000\u0000/media/data/sfleer/RAM/network.pyt\b\u0000\u0000\u0000<lambda>a\u0000\u0000\u0000t\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["add", 0, 0, {}]]], "name": "lambda_1"}, {"class_name": "Reshape", "config": {"target_shape": [256, 1], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "reshape_1"}, {"class_name": "SimpleRNN", "config": {"trainable": true, "recurrent_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": true, "activation": "relu", "bias_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "units": 256, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "kernel_constraint": null, "dropout": 0.0, "stateful": true, "recurrent_regularizer": null, "name": "rnn", "bias_constraint": null, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "rnn"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "name": "action_output", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "units": 10, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["rnn", 0, 0, {}]]], "name": "action_output"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "name": "location_output", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["rnn", 0, 0, {}]]], "name": "location_output"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "name": "baseline_output", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.1, "seed": null, "minval": -0.1}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["rnn", 0, 0, {}]]], "name": "baseline_output"}], "input_layers": [["glimpse_input", 0, 0], ["location_input", 0, 0]], "output_layers": [["action_output", 0, 0], ["location_output", 0, 0], ["baseline_output", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}